---
type: IFCFamilyInstanceExtrusionExportResults
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 6
tags: [revit-api, class]
---

# IFCFamilyInstanceExtrusionExportResults

`Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCutPairOpenings | 2012 | `public IList < IFCExtrusionData > GetCutPairOpenings ()` |
| Method | GetExtrusionHandle | 2012 | `public IFCAnyHandle GetExtrusionHandle ()` |
| Property | ExtraOffset | 2012 | `public XYZ ExtraOffset { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaterialId | 2012 | `public ElementId MaterialId { get ; }` |